# -*- mode: org; -*-
#+STARTUP: content
#+TODO: TODO(t) WAIT(w@/!) | DONE(d!) CANCELED(c@)
?#+TAGS:
?#+TAGS: { MY_1(a) MY_2(b) } MY_3
#+STARTUP: noptag
?#+PRIORITIES: A z B
#+STARTUP: logdrawer
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
#+COLUMNS: %25ITEM %TAGS :skip-empty-rows 1 :maxlevel 5

#+BEGIN: columnview :hlines 1 :id global
| ITEM                                                                                         | TAGS        | PRIORITY | TODO |
|----------------------------------------------------------------------------------------------+-------------+----------+------|
| Top level headline                                                                           |             | B        | WAIT |
| 2nd level                                                                                    |             | B        |      |
| 3rd level                                                                                    |             | B        |      |
| 3rd level                                                                                    |             | B        |      |
|----------------------------------------------------------------------------------------------+-------------+----------+------|
| pandas                                                                                       |             | B        |      |
| theory                                                                                       |             | B        |      |
| Do it                                                                                        |             | B        |      |
| gear-tools                                                                                   |             | B        |      |
| container                                                                                    |             | B        |      |
** update packages through MELPA
   :LOGBOOK:
   CLOCK: [2017-12-20 Wed 18:08]--[2017-12-25 Mon 10:44] => 112:36
   :END:
   * [X] mark ring :: C-x C-<space>
   * [ ] list symbol alternate :: c-u nth C-c - 
   * undo, always, no un-undo :: M-x undo-only


*** formula with emacs Calc
C-u C-u C-u <SPACE> <TAB>
#+CONSTANTS: myPI=3.14159265358979323846
|     <r3> | <c1>  |         | <l10> |           |   |
|  Student | Maths | Physics | Mean  | Pi number |   |
|----------+-------+---------+-------+-----------+---|
| Bertrand |  13   |      09 | 11    |         5 |   |
|    Henri |  15   |      14 | 14.5  |         7 |   |
|   Arnold |  17   |      13 | 15    |         9 |   |
|----------+-------+---------+-------+-----------+---|
|    Means |  15   |      12 | 13.5  |         7 |   |
#+TBLFM: $4=vmean($2..$3)::$5='(substring (number-to-string $myPI) (round $4) (1+ (round $4)));N::@6$2=vmean(@3$2..@5$2)::@6$3=vmean(@3$3..@5$3)::@6$4=vmean(@3$4..@5$4)

*** TODO fromula with lisp                                            :LUFFY:

| First name | Last Name | Email                |
|------------+-----------+----------------------|
| John       | Doe       | John.Doe@emacs.edu   |
| Jennie     | Duh       | Jennie.Duh@emacs.edu |
| Jack       | Goody     | Jack.Goody@emacs.edu |
#+TBLFM: $3='(concat $1 "." $2 "@emacs.edu")

| First name | Last name | Maths | French | Mean       |
|------------+-----------+-------+--------+------------|
| John       | Doe       |    12 |     16 | John: 14   |
| Jennie     | Duh       |    15 |      9 | Jennie: 12 |
#+TBLFM: $5='(concat "$1" ": " (number-to-string (/ (+ $3 $4) 2)));L

| col1 | col2 | col3                       | col4         | col5 |
|------+------+----------------------------+--------------+------|
| a    | a    | a b c d                    | #ERROR       |      |
| a    | b    | [a, a, b, c], [a, b, a, d] | [a, a, b, c] |      |
| b    | a    | a a b c a b a d            | [a, b, a, d] |      |
| c    | d    |                            | #ERROR       |      |
|      |      |                            | c            | d    |
#+TBLFM: @2$3='(mapconcat 'identity (delete-dups (list @2$1..@>$1 @2$2..@>$2)) " ")::@2$4='(mapconcat 'identity (union (list @2$1..@>$1) (list @2$2..@>$2))) " ")::@3$3=@2$1..@>$1 , @2$2..@>$2::@3$4=@2$1..@>$1::@4$3='(mapconcat 'identity (list @2$1..@>$1 @2$2..@>$2) " ")::@4$4=@2$2..@>$2::@5$4='(member '(a) @2$2..@>$2)::@6$4='(apply 'concat (delete-if (lambda(e) (member e (list @2$2..@>$2))) (list @2$1..@>$1)))::@6$5='(apply 'concat (delete-if (lambda(e) (member e (list @2$1..@>$1))) (list @2$2..@>$2)))

- delete-dups, intersection, union :: [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html][elisp-mono-web]]
- lambda DIY jianshu :: [[https://www.jianshu.com/p/ec64f8286875][lambda for lisp in org spreedtable formulas]]
- M-x hel m :: major/minor Mode enabled [[https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Modes][emacs' mode]]
- M-x package.... highlight-pare :: hl-pare
- colors 4 parentheses :: M-x help color-name-rgb-alist 


*** tmp test

| a | b | c | d      |
|---+---+---+--------|
| 1 | 2 | 3 | #ERROR |
| a | 4 | b |        |
| 5 | c | d |        |
|   |   |   |        |
#+TBLFM: @2$4='(delete-dups (list @2$1..@>$1));L

| a    | b | c | d                   |
|------+---+---+---------------------|
| 11f  | 2 | 3 | 11f                 |
| acwq | 4 | b | 11f acwq 5opc 2 4 c |
| 5opc | c | d | #ERROR              |
|      |   |   |                     |
#+TBLFM: @2$4='(concat (substring $1 1 2) (substring $1 0 1) (substring $1 2))::@3$4='(mapconcat 'identity (delete-dups (list @2$1..@>$1 @2$2..@>$2)) " ")::@4$4='(concat (delete-dups ( @2$1..@>$1 @2$2..@>$2)))
*** proj-1
    :PROPERTIES:
    :Owner:    Lisa
    :Status:   Not started yet
    :Time_Estimate: 3d 1h
    :Approved: [ ]
    :END:
    :LOGBOOK:
    CLOCK: [2017-12-20 Wed 17:52]--[2017-12-20 Wed 17:54] =>  0:02
    CLOCK: [2017-12-20 Wed 17:46]--[2017-12-20 Wed 17:48] =>  0:02
    CLOCK: [2017-12-20 Wed 17:19]--[2017-12-20 Wed 17:22] =>  0:03
    :END:

*** proj-2
    :PROPERTIES:
    :Owner:    Karl
    :STATUS:   Not started yet
    :Time_Estimate: 10d 10h
    :Approved: [X]
    :Effort:   4:00
    :END:
    :LOGBOOK:
    CLOCK: [2017-12-25 Mon 10:44]--[2017-12-25 Mon 10:45] =>  0:01
    CLOCK: [2017-12-20 Wed 17:54]--[2017-12-20 Wed 18:08] =>  0:14
    :END:
    
 dynamic blocks -- db
 #+BEGIN: columnview :hlines 1 :id local
 | ITEM       | Approved? | Owner | Status          | Time_Estimate | CLOCKSUM | CLOCKSUM_T |
 |------------+-----------+-------+-----------------+---------------+----------+------------|
 | quake zone | [-]       |       |                 | 13d 11:00     |     0:22 |       0:01 |
 | proj-1     | [ ]       | Lisa  | Not started yet | 3d 1h         |     0:07 |            |
 | proj-2     | [X]       | Karl  | Not started yet | 10d 10h       |     0:15 |       0:01 |
 #+END:

* The column view
  :LOGBOOK:
  CLOCK: [2017-12-25 Mon 10:51]--[2017-12-25 Mon 10:51] =>  0:00
  :END:



